import re
from dataclasses import dataclass


@dataclass
class WplacePixelCoords:
    # each tile contains 1000x1000 pixels, from 0 to 999
    tlx: int  # tile X
    tly: int  # tile Y
    pxx: int  # pixel X
    pxy: int  # pixel Y

    def human_repr(self) -> str:
        return f"Tl X: {self.tlx}, Tl Y: {self.tly}, Px X: {self.pxx}, Px Y: {self.pxy}"

    def offset(self, dx: int, dy: int) -> "WplacePixelCoords":
        x = self.tlx * 1000 + self.pxx + dx
        y = self.tly * 1000 + self.pxy + dy
        return WplacePixelCoords(x // 1000, y // 1000, x % 1000, y % 1000)


def fix_coords(
    coord1: WplacePixelCoords,
    coord2: WplacePixelCoords,
) -> tuple[WplacePixelCoords, WplacePixelCoords]:
    x1, x2 = sorted((coord1.tlx * 1000 + coord1.pxx, coord2.tlx * 1000 + coord2.pxx))
    y1, y2 = sorted((coord1.tly * 1000 + coord1.pxy, coord2.tly * 1000 + coord2.pxy))
    return (
        WplacePixelCoords(x1 // 1000, y1 // 1000, x1 % 1000, y1 % 1000),
        WplacePixelCoords(x2 // 1000, y2 // 1000, x2 % 1000, y2 % 1000),
    )


def get_all_tile_coords(
    coord1: WplacePixelCoords,
    coord2: WplacePixelCoords,
) -> list[tuple[int, int]]:
    coord1, coord2 = fix_coords(coord1, coord2)
    return [
        (x, y)
        for x in range(coord1.tlx, coord2.tlx + 1)
        for y in range(coord1.tly, coord2.tly + 1)
    ]


def get_size(
    coord1: WplacePixelCoords,
    coord2: WplacePixelCoords,
) -> tuple[int, int]:
    coord1, coord2 = fix_coords(coord1, coord2)
    width = (coord2.tlx - coord1.tlx) * 1000 + (coord2.pxx - coord1.pxx) + 1
    height = (coord2.tly - coord1.tly) * 1000 + (coord2.pxy - coord1.pxy) + 1
    return width, height


BLUE_MARBLE_COORDS_PATTERN = re.compile(
    r".+?Tl X: (\d+), Tl Y: (\d+), Px X: (\d+), Px Y: (\d+).+?"
)


def parse_coords(s: str) -> WplacePixelCoords:
    if not (m := BLUE_MARBLE_COORDS_PATTERN.match(s)):
        raise ValueError(f"Invalid coords: {s}")
    return WplacePixelCoords(int(m[1]), int(m[2]), int(m[3]), int(m[4]))


FLAG_MAPPING = {
    1: "🇦🇫",
    2: "🇦🇱",
    3: "🇩🇿",
    4: "🇦🇸",
    5: "🇦🇩",
    6: "🇦🇴",
    7: "🇦🇮",
    8: "🇦🇶",
    9: "🇦🇬",
    10: "🇦🇷",
    11: "🇦🇲",
    12: "🇦🇼",
    13: "🇦🇺",
    14: "🇦🇹",
    15: "🇦🇿",
    16: "🇧🇸",
    17: "🇧🇭",
    18: "🇧🇩",
    19: "🇧🇧",
    20: "🇧🇾",
    21: "🇧🇪",
    22: "🇧🇿",
    23: "🇧🇯",
    24: "🇧🇲",
    25: "🇧🇹",
    26: "🇧🇴",
    27: "🇧🇶",
    28: "🇧🇦",
    29: "🇧🇼",
    30: "🇧🇻",
    31: "🇧🇷",
    32: "🇮🇴",
    33: "🇧🇳",
    34: "🇧🇬",
    35: "🇧🇫",
    36: "🇧🇮",
    37: "🇨🇻",
    38: "🇰🇭",
    39: "🇨🇲",
    40: "🇨🇦",
    41: "🇰🇾",
    42: "🇨🇫",
    43: "🇹🇩",
    44: "🇨🇱",
    45: "🇨🇳",
    46: "🇨🇽",
    47: "🇨🇨",
    48: "🇨🇴",
    49: "🇰🇲",
    50: "🇨🇬",
    51: "🇨🇰",
    52: "🇨🇷",
    53: "🇭🇷",
    54: "🇨🇺",
    55: "🇨🇼",
    56: "🇨🇾",
    57: "🇨🇿",
    58: "🇨🇮",
    59: "🇩🇰",
    60: "🇩🇯",
    61: "🇩🇲",
    62: "🇩🇴",
    63: "🇪🇨",
    64: "🇪🇬",
    65: "🇸🇻",
    66: "🇬🇶",
    67: "🇪🇷",
    68: "🇪🇪",
    69: "🇸🇿",
    70: "🇪🇹",
    71: "🇫🇰",
    72: "🇫🇴",
    73: "🇫🇯",
    74: "🇫🇮",
    75: "🇫🇷",
    76: "🇬🇫",
    77: "🇵🇫",
    78: "🇹🇫",
    79: "🇬🇦",
    80: "🇬🇲",
    81: "🇬🇪",
    82: "🇩🇪",
    83: "🇬🇭",
    84: "🇬🇮",
    85: "🇬🇷",
    86: "🇬🇱",
    87: "🇬🇩",
    88: "🇬🇵",
    89: "🇬🇺",
    90: "🇬🇹",
    91: "🇬🇬",
    92: "🇬🇳",
    93: "🇬🇼",
    94: "🇬🇾",
    95: "🇭🇹",
    96: "🇭🇲",
    97: "🇭🇳",
    98: "🇭🇰",
    99: "🇭🇺",
    100: "🇮🇸",
    101: "🇮🇳",
    102: "🇮🇩",
    103: "🇮🇷",
    104: "🇮🇶",
    105: "🇮🇪",
    106: "🇮🇲",
    107: "🇮🇱",
    108: "🇮🇹",
    109: "🇯🇲",
    110: "🇯🇵",
    111: "🇯🇪",
    112: "🇯🇴",
    113: "🇰🇿",
    114: "🇰🇪",
    115: "🇰🇮",
    116: "🇽🇰",
    117: "🇰🇼",
    118: "🇰🇬",
    119: "🇱🇦",
    120: "🇱🇻",
    121: "🇱🇧",
    122: "🇱🇸",
    123: "🇱🇷",
    124: "🇱🇾",
    125: "🇱🇮",
    126: "🇱🇹",
    127: "🇱🇺",
    128: "🇲🇴",
    129: "🇲🇬",
    130: "🇲🇼",
    131: "🇲🇾",
    132: "🇲🇻",
    133: "🇲🇱",
    134: "🇲🇹",
    135: "🇲🇭",
    136: "🇲🇶",
    137: "🇲🇷",
    138: "🇲🇺",
    139: "🇾🇹",
    140: "🇲🇽",
    141: "🇫🇲",
    142: "🇲🇩",
    143: "🇲🇨",
    144: "🇲🇳",
    145: "🇲🇪",
    146: "🇲🇸",
    147: "🇲🇦",
    148: "🇲🇿",
    149: "🇲🇲",
    150: "🇳🇦",
    151: "🇳🇷",
    152: "🇳🇵",
    153: "🇳🇱",
    154: "🇳🇨",
    155: "🇳🇿",
    156: "🇳🇮",
    157: "🇳🇪",
    158: "🇳🇬",
    159: "🇳🇺",
    160: "🇳🇫",
    161: "🇰🇵",
    162: "🇲🇰",
    163: "🇲🇵",
    164: "🇳🇴",
    165: "🇴🇲",
    166: "🇵🇰",
    167: "🇵🇼",
    168: "🇵🇸",
    169: "🇵🇦",
    170: "🇵🇬",
    171: "🇵🇾",
    172: "🇵🇪",
    173: "🇵🇭",
    174: "🇵🇳",
    175: "🇵🇱",
    176: "🇵🇹",
    177: "🇵🇷",
    178: "🇶🇦",
    179: "🇨🇩",
    180: "🇷🇴",
    181: "🇷🇺",
    182: "🇷🇼",
    183: "🇷🇪",
    184: "🇧🇱",
    185: "🇸🇭",
    186: "🇰🇳",
    187: "🇱🇨",
    188: "🇲🇫",
    189: "🇵🇲",
    190: "🇻🇨",
    191: "🇼🇸",
    192: "🇸🇲",
    193: "🇸🇹",
    194: "🇸🇦",
    195: "🇸🇳",
    196: "🇷🇸",
    197: "🇸🇨",
    198: "🇸🇱",
    199: "🇸🇬",
    200: "🇸🇽",
    201: "🇸🇰",
    202: "🇸🇮",
    203: "🇸🇧",
    204: "🇸🇴",
    205: "🇿🇦",
    206: "🇬🇸",
    207: "🇰🇷",
    208: "🇸🇸",
    209: "🇪🇸",
    210: "🇱🇰",
    211: "🇸🇩",
    212: "🇸🇷",
    213: "🇸🇯",
    214: "🇸🇪",
    215: "🇨🇭",
    216: "🇸🇾",
    217: "🇹🇼",
    218: "🇹🇯",
    219: "🇹🇿",
    220: "🇹🇭",
    221: "🇹🇱",
    222: "🇹🇬",
    223: "🇹🇰",
    224: "🇹🇴",
    225: "🇹🇹",
    226: "🇹🇳",
    227: "🇹🇲",
    228: "🇹🇨",
    229: "🇹🇻",
    230: "🇹🇷",
    231: "🇺🇬",
    232: "🇺🇦",
    233: "🇦🇪",
    234: "🇬🇧",
    235: "🇺🇸",
    236: "🇺🇲",
    237: "🇺🇾",
    238: "🇺🇿",
    239: "🇻🇺",
    240: "🇻🇦",
    241: "🇻🇪",
    242: "🇻🇳",
    243: "🇻🇬",
    244: "🇻🇮",
    245: "🇼🇫",
    246: "🇪🇭",
    247: "🇾🇪",
    248: "🇿🇲",
    249: "🇿🇼",
    250: "🇦🇽",
    251: "🇮🇨",
}


def get_flag_emoji(id: int) -> str:
    return FLAG_MAPPING.get(id, "")


FREE_COLORS = {
    "Black",
    "Dark Gray",
    "Gray",
    "Light Gray",
    "White",
    "Deep Red",
    "Red",
    "Orange",
    "Gold",
    "Yellow",
    "Light Yellow",
    "Dark Green",
    "Green",
    "Light Green",
    "Dark Teal",
    "Teal",
    "Light Teal",
    "Dark Blue",
    "Blue",
    "Cyan",
    "Indigo",
    "Light Indigo",
    "Dark Purple",
    "Purple",
    "Light Purple",
    "Dark Pink",
    "Pink",
    "Light Pink",
    "Dark Brown",
    "Brown",
    "Beige",
}

ALL_COLORS = {
    "Black": (0, 0, 0),
    "Dark Gray": (60, 60, 60),
    "Gray": (120, 120, 120),
    "Medium Gray": (170, 170, 170),
    "Light Gray": (210, 210, 210),
    "White": (255, 255, 255),
    "Deep Red": (96, 0, 24),
    "Dark Red": (165, 14, 30),
    "Red": (237, 28, 36),
    "Light Red": (250, 128, 114),
    "Dark Orange": (228, 92, 26),
    "Orange": (255, 127, 39),
    "Gold": (246, 170, 9),
    "Yellow": (249, 221, 59),
    "Light Yellow": (255, 250, 188),
    "Dark Goldenrod": (156, 132, 49),
    "Goldenrod": (197, 173, 49),
    "Light Goldenrod": (232, 212, 95),
    "Dark Olive": (74, 107, 58),
    "Olive": (90, 148, 74),
    "Light Olive": (132, 197, 115),
    "Dark Green": (14, 185, 104),
    "Green": (19, 230, 123),
    "Light Green": (135, 255, 94),
    "Dark Teal": (12, 129, 110),
    "Teal": (16, 174, 166),
    "Light Teal": (19, 225, 190),
    "Dark Cyan": (15, 121, 159),
    "Cyan": (96, 247, 242),
    "Light Cyan": (187, 250, 242),
    "Dark Blue": (40, 80, 158),
    "Blue": (64, 147, 228),
    "Light Blue": (125, 199, 255),
    "Dark Indigo": (77, 49, 184),
    "Indigo": (107, 80, 246),
    "Light Indigo": (153, 177, 251),
    "Dark Slate Blue": (74, 66, 132),
    "Slate Blue": (122, 113, 196),
    "Light Slate Blue": (181, 174, 241),
    "Dark Purple": (120, 12, 153),
    "Purple": (170, 56, 185),
    "Light Purple": (224, 159, 249),
    "Dark Pink": (203, 0, 122),
    "Pink": (236, 31, 128),
    "Light Pink": (243, 141, 169),
    "Dark Peach": (155, 82, 73),
    "Peach": (209, 128, 120),
    "Light Peach": (250, 182, 164),
    "Dark Brown": (104, 70, 52),
    "Brown": (149, 104, 42),
    "Light Brown": (219, 164, 99),
    "Dark Tan": (123, 99, 82),
    "Tan": (156, 132, 107),
    "Light Tan": (214, 181, 148),
    "Dark Beige": (209, 128, 81),
    "Beige": (248, 178, 119),
    "Light Beige": (255, 197, 165),
    "Dark Stone": (109, 100, 63),
    "Stone": (148, 140, 107),
    "Light Stone": (205, 197, 158),
    "Dark Slate": (51, 57, 65),
    "Slate": (109, 117, 141),
    "Light Slate": (179, 185, 209),
}

PAID_COLORS = set(ALL_COLORS) - FREE_COLORS


def find_color_name(rgba: tuple[int, int, int, int]) -> str:
    if rgba[3] == 0:
        return "Transparent"

    rgb = rgba[:3]
    for name, value in ALL_COLORS.items():
        if value == rgb:
            return name

    # not found, find the closest one
    def color_distance(c1: tuple[int, int, int], c2: tuple[int, int, int]) -> int:
        return sum((a - b) ** 2 for a, b in zip(c1, c2, strict=True))

    closest_name = ""
    closest_distance = float("inf")
    for name, value in ALL_COLORS.items():
        dist = color_distance(rgb, value)
        if dist < closest_distance:
            closest_distance = dist
            closest_name = name
    return closest_name
